01-technical_support_fundamentals/05-software.md

# Table of Contents

1.  [Introduction to Software](#org3e58abb)
    1.  [What is Software?](#org6a547fc)
    2.  [Types of Software](#org5f75dbe)
    3.  [Revisiting abstraction](#orga01adbd)
    4.  [Recipe for Computer](#orgbbe8973)



<a id="org3e58abb"></a>

# Introduction to Software


<a id="org6a547fc"></a>

## What is Software?


### Coding

Translating one language to another.


### Scripting

Coding in a scripting language.

1.  Scripts

    Mainly used to perform a single or limited range task.


### Programming

Coding in a programming language.


### Programming Languages

Special languages that software developers use to write instructions for computers to execute.


<a id="org5f75dbe"></a>

## Types of Software

-   Commercial Software
-   Open-source Software


### Application Software

Any software created to fulfill a specific need, like a text editor, web browser, or graphic editor.


### System Software

Software used to keep our core system running, like OS tools and utilities.


### Firmware

Software that&rsquo;s permanently stored on a computer component.


<a id="orga01adbd"></a>

## Revisiting abstraction

The concept of taking a complex system and simplifying it for use.


<a id="orgbbe8973"></a>

## Recipe for Computer


### Assembly language

Allowed computer scientists to use human readable instructions, assembled into code, that the machine could understand.


### Compiled programming languages

Uses human readable instructions, then sends them through a compiler.


### Interpreted programming languages

The script is run by an interpreter, which interprets the code into CPU instructions just in time to run them.

